IDEA StatiCa Open Model
ConcreteCheckResultOverallItem.Result Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 check result passed/failed
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public CheckResult Result { get; set; }
Public Property Result As CheckResult
	Get
	Set
public:
property CheckResult Result {
	CheckResult get ();
	void set (CheckResult value);
}
Property Value
Type: CheckResult
See Also
Reference
ConcreteCheckResultOverallItem Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace